{
    "makerspace":[
        {
            "name": "University of Wisconsin-Madison College of Engineering, Makerspace",
            "topic": "Makerspace",
            "location": "Madison, WI",
            "date": "Feb 2022 - Present",
            "positionName": "Student Technician",
            "aboutJob": [
                {
                    "one": "Assists students, staff, and researchers with their personal and academic based projects with the use of 3D Printers, Laser Cutters, Solders, Mills, Microcontrollers, Circuit Boards, and several other technologies.",
                    "two": "Coordinating, teaching, and presenting instructional workshops to further students’ abilities in the above technologies."
                }
            ],
            "projects":[
                {
                    "react-app-description": "Developing a project that uses react to create a single-page application that connects an employee scheduling app, Deputy, to display the credentials/chair positions of who is on shift to the managers."
                }
            ]
        }
    ],
    "research":[
        {
            "name": "University of Wisconsin-Madison Undergraduate Research Scholar",
            "topic": "Research",
            "location": "Madison, WI",
            "date": "Sept 2021 - May 2022",
            "positionName": "Undergraduate Research Scholar",
            "projects":[
                {
                    "research-description": "Worked alongside a UW-Madison postdoctoral researcher where I designed algorithms through MATLAB to simulate large-scale statistical mechanics systems and I presented these findings at the Spring Undergraduate Symposium",
                    "symposium-slides": ""
                }
            ]
        }
    ],
    "swe":[
        {
            "name": "Society of Women Engineers Boeing Team",
            "location": "Madison, WI",
            "date": "Nov 2023 - Present",
            "positionName": "Software Engineering/Electrical Engineering Team Lead",
            "aboutJob": [
                {
                    "one": "Leading the Software Engineering/ECE SWE Boeing Team for this year’s project through PepsiCo.",
                    "two": "TODO: describe responsibilites"
                }
            ],
            "projects":[
                {
                    "react-app-description": "Developing a product to track food waste which will have a warning system, with sensors and Arduinos, and a canister status app, where I will teach the team React Native to develop the UI from scratch."
                }
            ]
        }
    ],
    "UIProject1":[
        {
            "name": "Name",
            "aboutJob": [
                {
                    "one": "describe what language it was built with and how long it took you (React)"
                }
            ],
            "projects":[
                {
                    "react-app-description": "",
                    "video": ""
                }
            ]
        }
    ],
    "UIProject2":[
        {
            "name": "Name",
            "aboutJob": [
                {
                    "one": "describe what language it was built with and how long it took you (React Native)"
                }
            ],
            "projects":[
                {
                    "react-app-description": "",
                    "video": ""
                }
            ]
        }
    ],
    "AlgoProject1":[
        {
            "name": "Name",
            "aboutJob": [
                {
                    "one": "describe what language it was built with and how long it took you (Java)"
                }
            ],
            "projects":[
                {
                    "react-app-description": "",
                    "video": ""
                }
            ]
        }
    ]
}