{
    "internships": [
        {
            "id": "001",
            "companyName": "Milliman",
            "location": "Brookfield, WI",
            "date": "May 2023 - Aug 2023",
            "positionName": "Software Development Intern",
            "accomplishments": [
                "Worked on 3 large projects for the entirety of the summer that involved building out entire console applications and web job applications using C, Azure resources, Postman, and AWS.",
                "Added functionality that allowed clients to get an identity specific medical claims file, upload this file to a blob storage location using a time limited URL, and a completely parsed and processed medical claims file will be returned for clients to download.",
                "Automated an entire process by creating a console app from scratch that gets most recent monthly/quarterly drug pricing files from prescription company websites to then update the files on record and the functionalities connected to these files.",
                "Created a web job app that replaced the outsourcing of a third-party company, who took half of the amount earned from every million-dollar contract, that handled the download, parse, and upload of enormous hospital files to an AWS bucket."
            ]
        },
        {
            "id": "002",
            "companyName": "Milliman",
            "location": "Brookfield, WI",
            "date": "June 2022 - Jan 2023",
            "positionName": "Software Development Intern",
            "accomplishments": [
                "Developed a wide variety of projects involving software solutions that assist insurance carriers, providers, brokers, employers, and government entities as well as manipulated data to withstand the growth of healthcare analytics.",
                "Collaborated to implement a new database structure aimed to improve time efficiency and assisted with documentation and research to implement innovative solutions and anticipate market demands. ",
                "Worked on ~3 projects a week from start to finish using SQL, Java, Java Script, C, ETL processes, and/or Azure software.",
                "Conducted testing on several new applications and debugged software developed by myself or other team members"
            ]
        },
        {
            "id": "003",
            "companyName": "University of Wisconsin-Madison College of Engineering, Makerspace",
            "location": "Madison, WI",
            "date": "Feb 2022 - Present",
            "positionName": "Student Technician",
            "accomplishments": [
                "Assists students, staff, and researchers with their personal and academic based projects with the use of 3D Printers, Laser Cutters, Solders, Mills, Microcontrollers, Circuit Boards, and several other technologies.",
                "Coordinating, teaching, and presenting instructional workshops to further students’ abilities in the above technologies."
            ]
        }
    ]
}